In [1]:

%env GOOGLE_APPLICATION_CREDENTIALS=/Users/klim/Desktop/area51.json

env: GOOGLE_APPLICATION_CREDENTIALS=/Users/klim/Desktop/area51.json

In [2]:
import pandas as pd
from google.cloud import bigquery

client = bigquery.Client()

In [4]:
sql = """
select (tokens is null) has_tokens,  count(*) from intermediate.tweet_tokens
group by 1
"""
df = client.query(sql).to_dataframe()
df.head(10)

   has_tokens      f0_
0       False  3564232
1        True  1217815

In [10]:
sql = """
select id, data_date from marts.fct_users
where id = '1029731768365068288'
"""
df = client.query(sql).to_dataframe()
df

                    id   data_date
0  1029731768365068288  2022-08-03
1  1029731768365068288  2022-08-04
2  1029731768365068288  2022-08-05
3  1029731768365068288  2022-08-06
4  1029731768365068288  2022-08-07
5  1029731768365068288  2022-08-14
6  1029731768365068288  2022-08-15
7  1029731768365068288  2022-08-16